InformationRegisters/НастройкиОхраныТруда.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<InformationRegister>
		<Properties>
			<Name>НастройкиОхраныТруда</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>ИспользоватьРабочиеМестаОхраныТруда</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ИспользоватьИнструктажиПоОхранеТруда</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ИспользоватьОбучениеПоОхранеТруда</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ИспользоватьНесчастныеСлучаиНаПроизводстве</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ИспользоватьМедицинскиеОсмотры</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ИспользоватьПсихиатрическиеОсвидетельствования</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ИспользоватьСпециальнуюОценкуУсловийТруда</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ИспользоватьСредстваИндивидуальнойЗащиты</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>КонтролироватьУникальностьНомеровРабочихМест</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СпособКонтроляУникальностиНомеровРабочихМест</Name>
					<Type>
						<v8:Type>cfg:EnumRef.СпособыКонтроляУникальностиНомеровРабочихМест</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ПрименятьУсловияТрудаРабочихМестОхраныТруда</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ПорогАктуальностиВредныхФакторовВидовРабот</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>2</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ЕдиницаИзмеренияПорогаАктуальностиВредныхФакторовВидовРабот</Name>
					<Type>
						<v8:Type>cfg:EnumRef.Периодичность</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

InformationRegisters/НастройкиОхраныТруда/Ext/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

#Область ДляВызоваИзДругихПодсистем

// СтандартныеПодсистемы.УправлениеДоступом

// См. УправлениеДоступомПереопределяемый.ПриЗаполненииСписковСОграничениемДоступа.
Процедура ПриЗаполненииОграниченияДоступа(Ограничение) Экспорт
	Ограничение.Текст =
	"РазрешитьЧтениеИзменение
	|ГДЕ
	|	ЗначениеРазрешено(Организация)";
КонецПроцедуры

// Конец СтандартныеПодсистемы.УправлениеДоступом

#КонецОбласти

#КонецОбласти

#Область СлужебныйПрограммныйИнтерфейс

#Область ОбработчикиПравилРегистрации

// См. ЗарплатаКадрыРасширенныйСинхронизацияДанных.ШаблонОбработчика
Процедура ПриЗаполненииНастроекОбработчиковПравилРегистрации(Настройки) Экспорт
	ЗарплатаКадрыРасширенныйСинхронизацияДанных.ДляОтбораПоОрганизации(Настройки);
КонецПроцедуры

#КонецОбласти

Функция СведенияОНастройкахОхраныТруда(Организация) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("ЕстьОрганизация", ЗначениеЗаполнено(Организация));
	Запрос.УстановитьПараметр("Организация", Организация);
	Запрос.Текст =
		"ВЫБРАТЬ
		|" + ТекстПолейДляЗапросаСведенийОНастройках() + "
		|ИЗ
		|	РегистрСведений.НастройкиОхраныТруда КАК НастройкиОхраныТруда
		|ГДЕ
		|	ВЫБОР
		|		КОГДА &ЕстьОрганизация
		|			ТОГДА НастройкиОхраныТруда.Организация = &Организация
		|		ИНАЧЕ ИСТИНА
		|	КОНЕЦ";
	
	Возврат ОбщегоНазначения.СтрокаТаблицыЗначенийВСтруктуру(Запрос.Выполнить().Выгрузить()[0]);
	
КонецФункции

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Функция ТекстПолейДляЗапросаСведенийОНастройках()
	
	ТекстПолейЗапроса = "";
	
	ОписаниеРегистра = ЗарплатаКадрыОбщиеНаборыДанных.ОписаниеРегистра("НастройкиОхраныТруда");
	Для Каждого ИмяРесурса Из ОписаниеРегистра.Ресурсы Цикл
		Если ИмяРесурса = "СпособКонтроляУникальностиНомеровРабочихМест" Тогда
			ВыражениеЗаменыNull = "ЗНАЧЕНИЕ(Перечисление.СпособыКонтроляУникальностиНомеровРабочихМест.ПустаяСсылка)";
		ИначеЕсли ИмяРесурса = "ПорогАктуальностиВредныхФакторовВидовРабот" Тогда
			ВыражениеЗаменыNull = "0";
		ИначеЕсли ИмяРесурса = "ЕдиницаИзмеренияПорогаАктуальностиВредныхФакторовВидовРабот" Тогда
			ВыражениеЗаменыNull = "ЗНАЧЕНИЕ(Перечисление.Периодичность.ПустаяСсылка)";
		Иначе
			ВыражениеЗаменыNull = "ЛОЖЬ";
		КонецЕсли;
		
		ТекстПоля = СтрШаблон("
		|	ЕСТЬNULL(МАКСИМУМ(%1), %2) КАК %1", ИмяРесурса, ВыражениеЗаменыNull);
		ТекстЗапятая = ?(ПустаяСтрока(ТекстПолейЗапроса), "", ",");
		ТекстПолейЗапроса = СтрШаблон("%1%2%3", ТекстПолейЗапроса, ТекстЗапятая, ТекстПоля);
	КонецЦикла;
	
	Возврат ТекстПолейЗапроса;

КонецФункции

#КонецОбласти

#КонецЕсли
